import s from "./PrivacyPolicyPage.module.scss";

export default function PrivacyPolicyPage() {
  const text1 =
    "Правила обробки, зберігання та захисту даних Клієнтів (надалі-Правила) визначають порядок поводження з даними користувачів сайту https://100rokiv.com.ua/";
  const text2 =
    "Погоджуючись з цими Правилами, Користувач дає дозвіл на збір, зберігання, використання та розголошення своїх даних, (в т. ч., але не обов'язково, персональних даних), у відповідності з цими Правилами, Законом України «Про захист прав споживачів», «Про захист персональних даних», «Про захист інформації в інформаційно-телекомунікаційних системах». \n \nПравила дійсні з моменту оформлення замовлення на сайті https://100rokiv.com.ua/. Збір та використання персональних даних про клієнта. Дані Користувача є інформацією з обмеженим доступом. \n \nДані Користувача зберігаються в базі даних сайту https://100rokiv.com.ua/ до трьох років і обробляються за допомогою автоматизованої системи. \n \nМета обробки даних Користувача - забезпечення реалізації адміністративно-правових відносин, відносин у сфері податкового і бухгалтерського обліку, реклами, інших відносин, при яких використовуються дані Користувачів. \n \nНа сайті https://100rokiv.com.ua/ можуть збиратися, зберігатися і використовуватися наступні дані: \n1. Адреса електронної пошти (e-mail); \n2. Номер мобільного телефону; \n3. Адреса; \n4. Інші дані, які були надані Користувачем на сайті https://100rokiv.com.ua/. \n \nКористувач погоджується з тим, що передані їм дані можуть використовуватися для: \n1. Оформленні замовлення користувачем на сайті https://100rokiv.com.ua/; \n2. Надання послуг клієнту; \n3. Повідомлення клієнта про послуги, новини та рекламні пропозиції за допомогою SMS, електронних повідомлень, пошти і т. д.";
  const text3 =
    "Дані користувача надаються третім особам у наступних випадках: \n1. Отримано додаткову згоду клієнта; \n2. Надання загальної інформації (статистичні дані, узагальнена інформація), яка не містить персональну інформацію і яка не ідентифікує клієнта індивідуально; \n3. Надання інформації правоохоронним та іншим державним органам у відповідь на їх офіційний запит щодо кримінального розслідування або можливої протиправної діяльності.";
  const text4 =
    "https://100rokiv.com.ua/ зобов'язується вживати належні заходи безпеки для захисту від неправомірного доступу або неправомірної зміни, розкриття або знищення даних Користувача.";

  return (
    <main>
      <section className={s.section}>
        <h1 className={s.title}>Політика конфіденційності</h1>
        <p className={s.text}>{text1}</p>
        <h2 className={s.subTitle}>Основні положення</h2>
        <p className={s.text}>{text2}</p>
        <h2 className={s.subTitle}>Розголошення даних Клієнта</h2>
        <p className={s.text}>{text3}</p>
        <h2 className={s.subTitle}>Захист даних</h2>
        <p className={s.text}>{text4}</p>
      </section>
    </main>
  );
}
